//*** */ ১ম দারনা শুরু বিষয় ** video--16.3//

var weiht=55;
var year=20;
console.log(weiht)
console.log(year)
console.log(weiht, year)

// -----------------------------------------------------------------------------;

// *** নাম বা "" বা '' দ্বারা কাজ  String বিষয়  **video--16.4**//

var Rabby = 'Moshipur, Talghashi';
var address = 'Shahzadpur, Pabna';
console.log(Rabbi, address)
console.log(Rabbi + ' ' + address)

// ---------------------------------------------------------------------------------;

//*** */ Srting বা Nambar বা Boolean চেক করতে তার বিষয় বা true false  *** video-16.5**//

var Rabbe = 30;
var address='Moshipur';
var Rakib=true
console.log(typeof Rakib)
console.log(typeof address)
console.log(typeof Rabbi)

// ----------------------------------------------------------------------------;

// ** যোগ করার বিষয় বা .পরে কয়টা ঘর নিবো তার হিসাব total fixed **video--16.6**/

var Mohid =20;
var mohid =30;
console.log(Mohid+mohid)

var Nohid =20;
var nohid =29.99;
var total= Nohid + nohid
console.log(total.toFixed(3))

// -----------------------------------------------------------------------------;

// *** অনেক ট্যাগ যোগ ফল হিসাব একতার ভিতর যোগ করে **video--16.7***//

var Najim = 35;
 jogh =Najim +35;
 kajim =jogh + 30 ;
console.log(kajim)

// ------------------------------------------------------------------------------;

//**** */ গুণ করার বিষয় আলোচনা ***video--16.8***//

var Rabbi =30;
var Rakib =3;
var Najim =Rabbi*Rakib;
console.log(Najim);

// ------------------------------------------------------------------------------;

// **** JavaScript গুরুত্বপূর্ণ বিষয় আলোচনা ***video--17.1-২ একি ***//

//  "<" মানে ছোট যেমন (৫<১০) ১০ ছে ৫ ছোট । *(১০<৫) ১০ছে ৫ বড় হবে না।*
//  ">" মানে বড় যেমন (৫>১০) ৫ ছে ১০ বড় । *(২০>১০) ২০ছে ১০ বড় হবে না।*
//  "==" মানে সমান সমান যেমন (১০==১০) সমান।
//  ">=" মানে বড় অথবা সমান যেমন (১০>=১১) শর্ত মানে। যেকোনো একটা শর্ত মানলেই হবে।
// "<=" মানে ছোট অথবা সমান যেমন (২০<=১৯) শর্ত মানে। যেকোনো একটা শর্ত মানলেই হবে ।
//  "।।" মানে যেকোনো একটা শর্ত মানলেই হবে।
//  "&&" মানে সব শর্তই মানতে হবে না হলে কিছু আসবে না।

//  ------------------------------------------------------------------------------------;

// ***** শর্ত মানার বিষয় if  বা else আলোচনা ***video-17.3***//
    //  *** মানবে if মানবে*** ছোট **

var Rabbe =40;
if(Rabbe>30){
    console.log('manbe shorto mane') 
}
else{
    console.log('manbe na shortu')
}

// *** মানবে else মানবে*** বড় **

var Rakib =40;
if(Rakib<30){
    console.log('Manbe na')
}
else {
    console.log('ata manbe')
}

// -------------------------------------------------------------------------------------;

// ***** '&' and বিষয় আর '।।' বিষয় আলোচনা var পরিবরতে const ব্যাবহার করে  *** video--17.4***//  

const Rabbi =500;
const Rakib=1000;
if(Rabbi < 600 && Rakib > 900){
    console.log('mantei hobe')
}
else {
    console.log('manbe na')
}


const Shihab=100;
const Rafi=200;
if(Shihab>50 || Rafi<300){
    console.log('he')
}
else {
    console.log('na')
}

// ------------------------------------------------------------------------------------------;

// ***** video-- 17.5,  17.6,  17.7,  17.8,  17.9 বাশিক ধারনা বা আলোচনা পাঁজটি ভিডিও ধারনা ******

// ----------------------------------------------------------------------------------------------------;

// ***** Array এরে সম্পর্কে আলোচনা কি কি এরে ***video--17.5-1 ***//

// const Nambar=[1, 2, 3, 5, 6, 7, 9, 10, 20, 30, 40, 50,100];
// const friends=['Rabbi', 'Rakib', 'Rayhan', 'Najim', 'Rifat', 'Rafi'];
// const Passed =[true, false, true, false];
// cont mixedArray=[12, Rabbi, true, 46.55, false];

// ----------------------------------------------------------------------------------------------;

// *****একটা এরে ভিতের যদি কন কিছু খোজার বিষয় **** video--17.5-2***///

const Nambar=[10, 20, 50, 60, 20, 60, 30, 40, 50, 60, 25];
console.log(Nambar.length)

// **** length মানে এরের ভিতর কয়টা মান আছে তার হিসাব *** এরে কিন্তু ০ থেকে শরু হয়।-- যেমন-

const Rabbi =[11, 20, 30, 22, 55, 60, 60, 90, 30, 40, 70, 80, 90];
console.log(Rabbi[3])

// ***"[3]" মানে এরের ভিতর কন নামবার এরে টা দেকব তার হিসাব 

// ---------------------------------------------------------------------------------------------------;

// **** যদি এরের নাম বা সংখ্যা দুকাতে চাই বা বের করতে চাই ১ম , শেষে push , pop **** video---17.5--3***///

// const Nambar=[10, 20, 50, 60, 90, 70, 80, 80, 100];
// Nambar.push(50, 50, 70, 50, 50, 50,)
// console.log(Nambar)

// Nambar.pop();
// Nambar.pop();
// console.log(Nambar)

// ** ১ম থাকে চলে যাবে 

// Nambar.shift();

// **১ম যোগ করতে চাইলে.

// Nambar.unshift();

// ----------------------------------------------------------------------------------------------------;
